armadillo
arpack
autoconf
automake
boost
cabal-install
cairo
cmake
coreutils
cscope
eigen
ffmpeg
fftw
fish
fontconfig
fontforge
freetype
fribidi
fzf
fzy
gcc
gdbm
gettext
ghc
ghc@8.0
ghostscript
ghq
git
git-lfs
glib
gmp
gnu-sed
go
gobject-introspection
graphite2
grc
gsl
harfbuzz
hdf5
hugo
hyper
icu4c
ilmbase
imagemagick
isl
jemalloc
jpeg
lame
libevent
libffi
libgit2
libmpc
libogg
libpng
libssh2
libtermkey
libtiff
libtool
libuv
libvorbis
libvpx
libvterm
libxml2
libxslt
libyaml
little-cms2
llvm
lua
luajit
macvim
mas
mbedtls
mosh
mpfr
msgpack
ncurses
neovim
node
nodebrew
numpy
openblas
opencv
openexr
openjpeg
openssl
opus
pacvim
pandoc
pandoc-citeproc
pandoc-crossref
pango
pcre
pcre2
peco
perl
pixman
pkg-config
protobuf
pyenv
pyqt
python
python3
python@2
qt
qt@5.7
r
rbenv
readline
reattach-to-user-namespace
remake
ricty
ripgrep
ruby
ruby-build
sdl2
sip
snappy
sqlite
superlu
szip
tbb
tcl-tk
texinfo
the_silver_searcher
theora
tmux
tmux-mem-cpu-load
tree
unibilium
unixodbc
v8@3.15
veclibfort
vim
webp
x264
x265
xvid
xz
zsh
