alacritty
arpack-julia
autoconf
automake
boost
cabal-install
cairo
cmake
coreutils
cscope
eigen
fftw
fish
fontconfig
fontforge
freetype
fzf
gcc
gdbm
gettext
ghc
git
git-lfs
glib
gmp
gobject-introspection
graphite2
grc
harfbuzz
hyper
icu4c
ilmbase
isl
jemalloc
jpeg
julia
libevent
libffi
libgit2
libmpc
libpng
libssh2
libtermkey
libtiff
libtool
libuv
libvterm
libxml2
libxslt
libyaml
llvm-4.0
llvm37-julia
lua
luajit
macvim
mas
mbedtls
mpfr
msgpack
neovim
node
nodebrew
numpy
openblas-julia
opencv
openexr
openssl
pacvim
pandoc
pango
pcre
pcre2
peco
perl
pixman
pkg-config
pyenv
pyqt
pyqt5
python
python3
qt
qt5
qt@5.7
r
rbenv
readline
reattach-to-user-namespace
ricty
ruby
ruby-build
sip
sqlite
suite-sparse-julia
texinfo
the_silver_searcher
tmux
unibilium
vim
xz
zsh
