cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew 'zsh'
brew 'peco'
brew 'vim', args: ['with-lua']
brew 'neovim'
brew 'cmake'
brew 'ffmpeg'
brew 'tree'
brew 'git'
brew 'wget'
brew 'ghq'
brew 'python'
brew 'python3'
brew 'pyenv'
brew 'libxml2'
brew 'libgit2'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'fzf'
brew 'fzy'
brew 'the_silver_searcher'
brew 'ruby'
brew 'ruby-build'
brew 'screenfetch'
brew 'neofetch'
brew 'imagemagick'
brew 'openmpi'
brew 'openblas'
brew 'openssl'
brew 'readline'
brew 'fontforge'
brew 'ghostscript'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pandoc-crossref'
brew 'r', args: ['with-openblas']
brew 'reattach-to-user-namespace'
brew 'go'

cask "google-chrome"
cask "atom"
cask "dropbox"
cask "alacritty"
cask "zotero"
cask "spotify"
cask "gitkraken"
cask "sourcetree"
cask "discord"
cask "docker"
cask "expressvpn"
cask "shadowsocksx-ng"
cask "java"
cask "vlc"
cask "google-japanese-ime"
cask "google-photos-backup-and-sync"
cask "adobe-creative-cloud"
cask "adobe-acrobat-reader"
cask "java8"
cask "visual-studio-code"
cask "amazon-music"
cask "amazon-photos"
cask "brave-browser"
cask "mactex-no-gui"
cask "openconnect-gui"

mas  "Tomato One", id: 907364780
mas  "Gifted", id: 771955779
mas  "BetterSnapTool", id: 417375580
mas  "Keynote", id: 409183694
mas  "Airmail 3", id: 918858936
mas  "GarageBand", id: 682658836
mas  "AntiSleep", id: 946798523
mas  "WeChat", id: 836500024
mas  "DaisyDisk", id: 411643860
mas  "Numbers", id: 409203825
mas  "Pages", id: 409201541
mas  "Enpass", id: 732710998
mas  "iMovie", id: 408981434
mas  "OmniFocus", id: 867299399
mas  "Elmedia Video Player", id: 1044549675
mas  "Line", id: 539883307
mas  "Slack", id: 803453959
mas  "QQ", id: 451108668
mas  "Spark", id: 1176895641
mas  "PopClip", id: 445189367
mas  "Affinity Designer", id: 824171161
mas  "Mactracker", id: 430255202
mas  "Microsoft Remote Desktop", id: 1295203466
