arpack-julia
autoconf
cairo
cask
cmake
cscope
emacs
ffmpeg
fftw
fontconfig
fontforge
freetype
fribidi
fzf
fzy
gcc
gdbm
gettext
ghostscript
ghq
giflib
git
glib
gmp
gnutls
graphite2
harfbuzz
icu4c
imagemagick
isl
jemalloc
jpeg
lame
libevent
libffi
libgit2
libidn2
libmpc
libogg
libpng
libspiro
libssh2
libtasn1
libtermkey
libtiff
libtool
libuninameslist
libunistring
libuv
libvorbis
libvpx
libvterm
libxml2
libyaml
little-cms2
llvm37-julia
lua
luajit
mas
mbedtls
mpfr
msgpack
ncurses
neofetch
neovim
nettle
open-mpi
openblas
openblas-julia
openjpeg
openssl
opus
p11-kit
pandoc
pandoc-citeproc
pandoc-crossref
pango
pcre
pcre2
peco
perl
pixman
pkg-config
pyenv
python
python@2
r
readline
ruby
ruby-build
screenfetch
screenresolution
sdl2
snappy
sqlite
suite-sparse-julia
theora
tmux
tmux-mem-cpu-load
trash
tree
unibilium
vim
webp
wget
x264
x265
xvid
xz
zsh
