cask_args appdir: "/Applications"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "openssl@3"
brew "sqlite"
brew "automake"
brew "libgit2"
brew "bat"
brew "bottom"
brew "gettext"
brew "cmake"
brew "coreutils"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "geos"
brew "pkgconf"
brew "proj"
brew "openblas"
brew "poppler"
brew "gdal"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "gitui"
brew "go"
brew "htop"
brew "imagemagick"
brew "latexdiff"
brew "lazydocker"
brew "lazygit"
brew "lua"
brew "mas"
brew "neovim"
brew "nmap"
brew "node"
brew "p7zip"
brew "pandoc"
brew "pdftk-java"
brew "pipx"
brew "pyenv"
brew "qpdf"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rustup"
brew "sd"
brew "stow"
brew "tailscale"
brew "tbb"
brew "tmux"
brew "udunits"
brew "v8"
brew "wget"
brew "yarn"
brew "zeromq"
brew "zoxide"
brew "zsh"
brew "qmk/qmk/qmk"
cask "alacritty", args: { appdir: "/Applications" }
cask "arc", args: { appdir: "/Applications" }
cask "brave-browser", args: { appdir: "/Applications" }
cask "chatgpt"
cask "claude-code", args: { appdir: "/Applications" }
cask "codex"
cask "db-browser-for-sqlite", args: { appdir: "/Applications" }
cask "deepl", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "dropbox", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-latin-modern", args: { appdir: "/Applications" }
cask "font-latin-modern-math", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-drive"
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "keyboardcleantool", args: { appdir: "/Applications" }
cask "localsend", args: { appdir: "/Applications" }
cask "numi", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "ollama-app", args: { appdir: "/Applications" }
cask "orbstack", args: { appdir: "/Applications" }
cask "quarto", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "rstudio", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "tailscale-app"
cask "the-unarchiver", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
cask "zotero", args: { appdir: "/Applications" }
mas "AdGuard Mini", id: 1440147259
mas "Adobe Lightroom", id: 1451544217
mas "Be Focused Pro", id: 961632517
mas "Blackmagic Disk Speed Test", id: 425264550
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Enpass", id: 732710998
mas "Flighty", id: 1358823008
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Keynote", id: 361285480
mas "LINE", id: 539883307
mas "Mactracker", id: 430255202
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shadowrocket", id: 932747118
mas "Sleep Control Center", id: 946798523
mas "Todoist", id: 585829637
mas "VooV", id: 1497685373
mas "WeChat", id: 836500024
vscode "analytic-signal.preview-html"
vscode "analytic-signal.preview-tiff"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "ivan-bocharov.stan-vscode"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "koehlma.markdown-math"
vscode "mhutchie.git-graph"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "rdebugger.r-debugger"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rlivings39.fzf-quick-open"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "valentjn.vscode-ltex"
vscode "vspacecode.whichkey"
go "github.com/mischavandenburg/go/projects/title/cmd/title"
