tap "homebrew/bundle"
brew "libtiff"
brew "sqlite"
brew "llvm"
brew "automake"
brew "bat"
brew "bottom"
brew "cabal-install"
brew "gettext"
brew "python@3.12"
brew "cmake"
brew "coreutils"
brew "zeromq"
brew "cppzmq"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "libgit2"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "geos"
brew "pkgconf"
brew "proj"
brew "libxml2"
brew "openblas"
brew "poppler"
brew "gdal"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "gitui"
brew "gitup"
brew "glpk"
brew "go"
brew "gotop"
brew "gsl"
brew "htop"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "javacc"
brew "latexdiff"
brew "lazydocker"
brew "lazygit"
brew "librsvg"
brew "lua"
brew "mas"
brew "mosh"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "open-mpi"
brew "pandoc"
brew "pdftk-java"
brew "peco"
brew "pipx"
brew "pyenv"
brew "qpdf"
brew "r"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "sd"
brew "stow"
brew "tbb"
brew "tmux"
brew "udunits"
brew "urlview"
brew "v8"
brew "wget"
brew "wimlib"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zsh"
cask "alacritty"
cask "chromedriver"
cask "discord", args: { appdir: "/Applications" }
cask "font-latin-modern"
cask "font-latin-modern-math"
cask "google-chrome", args: { appdir: "/Applications" }
cask "mimestream"
cask "neardrop"
cask "numi"
cask "quarto"
cask "rstudio"
cask "sourcetree"
cask "spotify", args: { appdir: "/Applications" }
cask "warp"
cask "zotero", args: { appdir: "/Applications" }
mas "Adobe Lightroom", id: 1451544217
mas "Be Focused Pro", id: 961632517
mas "BetterSnapTool", id: 417375580
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Enpass", id: 732710998
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Mactracker", id: 430255202
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sleep Control Center", id: 946798523
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Twitter", id: 1482454543
mas "WeChat", id: 836500024
vscode "adamvoss.vscode-languagetool"
vscode "adamvoss.vscode-languagetool-en"
vscode "analytic-signal.preview-html"
vscode "analytic-signal.preview-tiff"
vscode "anseki.vscode-color"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "bito.bito"
vscode "cschlosser.doxdocgen"
vscode "darkriszty.markdown-table-prettify"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "fnando.linter"
vscode "genieai.chatgpt-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "henrytsz.nvim"
vscode "hogashi.crontab-syntax-highlight"
vscode "id-wj.transparent-win"
vscode "ivan-bocharov.stan-vscode"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "julialang.language-julia"
vscode "koehlma.markdown-math"
vscode "liviuschera.noctis"
vscode "mblode.zotero"
vscode "mhutchie.git-graph"
vscode "mikhail-arkhipov.r"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "natizyskunk.sftp"
vscode "onnovalkering.vscode-singularity"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "rdebugger.r-debugger"
vscode "reditorsupport.r"
vscode "rlivings39.fzf-quick-open"
vscode "sirtori.indenticator"
vscode "streetsidesoftware.code-spell-checker"
vscode "tialki.tex-preview"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "xadillax.viml"
vscode "yinfei.luahelper"
vscode "znck.grammarly"
