tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "wez/wezterm"
brew "libtiff"
brew "automake"
brew "bat"
brew "cabal-install"
brew "cask"
brew "cmake"
brew "docker"
brew "docker-machine"
brew "libgit2"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "sqlite"
brew "fontforge"
brew "fzf"
brew "fzy"
brew "geos"
brew "proj"
brew "libxml2"
brew "openblas"
brew "poppler"
brew "gdal"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "gitui"
brew "gitup"
brew "go"
brew "gotop"
brew "gsl"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "javacc"
brew "latexdiff"
brew "llvm"
brew "lua"
brew "ruby"
brew "macvim"
brew "mas"
brew "mosh"
brew "neofetch"
brew "neovim"
brew "node"
brew "open-mpi"
brew "pandoc"
brew "peco"
brew "pkg-config"
brew "pyenv"
brew "qpdf"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "sd"
brew "stow"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "udunits"
brew "urlview"
brew "v8"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
cask "alacritty"
cask "discord", args: { appdir: "/Applications" }
cask "phantomjs"
cask "quarto"
cask "r"
cask "rstudio"
cask "sourcetree"
cask "spotify", args: { appdir: "/Applications" }
cask "zotero", args: { appdir: "/Applications" }
mas "Adobe Lightroom", id: 1451544217
mas "BetterSnapTool", id: 417375580
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "Enpass", id: 732710998
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Mactracker", id: 430255202
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "QQ", id: 451108668
mas "Slack", id: 803453959
mas "Sleep Control Center", id: 946798523
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Twitter", id: 1482454543
mas "VooV", id: 1497685373
mas "WeChat", id: 836500024
vscode "anseki.vscode-color"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "cschlosser.doxdocgen"
vscode "darkriszty.markdown-table-prettify"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "fnando.linter"
vscode "gencay.vscode-chatgpt"
vscode "genieai.chatgpt-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "hogashi.crontab-syntax-highlight"
vscode "ID-wj.transparent-win"
vscode "ivan-bocharov.stan-vscode"
vscode "James-Yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "julialang.language-julia"
vscode "koehlma.markdown-math"
vscode "liviuschera.noctis"
vscode "liximomo.sftp"
vscode "mblode.zotero"
vscode "mhutchie.git-graph"
vscode "Mikhail-Arkhipov.r"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "Natizyskunk.sftp"
vscode "onnovalkering.vscode-singularity"
vscode "PKief.material-icon-theme"
vscode "quarto.quarto"
vscode "RDebugger.r-debugger"
vscode "REditorSupport.r"
vscode "rlivings39.fzf-quick-open"
vscode "SirTori.indenticator"
vscode "spadin.remote-x11-ssh"
vscode "streetsidesoftware.code-spell-checker"
vscode "tht13.html-preview-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "VSpaceCode.whichkey"
vscode "XadillaX.viml"
vscode "yinfei.luahelper"
vscode "znck.grammarly"
